{
    "url": "https://www.techradar.com/audio/spotify/i-dismissed-spotifys-ai-dj-for-years-heres-why-im-finally-warming-up-to-the-streaming-giants-most-divisive-feature",
    "title": "I dismissed Spotifys AI DJ for years heres why Im finally warming up to the streaming giants most divisive feature",
    "author": "Rowan Davies",
    "publication_date": "2025-06-20T18:00:00Z",
    "content": "Hello, DJ, my old friend When you purchase through links on our site, we may earn an affiliate commission.Heres how it works. AI features inmusic streaming serviceshave divided music fans like the Red Sea, and Ive found myself torn between which features are good and which ones are bad, especially when it comes toSpotifys AI DJ. Spotifylaunched this feature back in 2023, describing it as a personalized AI guide that knows you and your music taste so well that it can choose what to play for you. When you press play on your DJ, it will start a listening session in the style of a radio show with a voiceover separating each segment Initially, I cant say I was entirely pleased with the experience. I think its the voice that pushed me over the edge. That combined with its repetitive music suggestions, I never returned to it, but thats recently changed. One of the biggest setbacks of the standard AI DJ was my experience with repeated songs and genres. But its been a while since I first used it, and Ive listened to a lot more music since then, which Ive learned is the trick to unlocking its full potential. With that said, I think that AI DJ works better if youre really into your music and listen to different genres and artists daily. That way, AI DJ will pick up on your varied listening habits and will know to offer you something different each time. But Spotify has recently come up with a solution that puts you in the driver's seat.  For the past two years, AI DJ's capabilities have remained stagnant. Until this year, whenSpotify rolled out DJs new request function,which marked its first major change. This means that users can have more input with DJs playback and can use voice prompts to ask for specific music. I had to give it a go. The first time I tried it out, I asked the DJ, \"Play melancholy '90s featuring Radiohead and friends,\" and it kicked things off withNo Surprises, followed by Fontaines DCsI Love You. From my first prompt, AI DJ showed that it can match moods on the spot, but could be a little more precise when matching time periods. However, this wasnt a huge issue, as it followed through with The Verve, Bjork, and Mazzy Star as the request segment progressed. Sign up for breaking news, reviews, opinion, top tech deals, and more.  During my second attempt, I took the opportunity to use AI DJ to discover new artists from one of my favorite genres, asking it to \"Play some underground disco from the 70s and 80s.\" This one didnt disappoint. Instead of the classic disco tracks that everyone knows and loves, AI DJ inundated my listening session with artists and songs that I never wouldve come across had I not requested it. As well as Spotifys Release Radar and New Music Friday playlists, Ill definitely be returning to AI DJs request function to see what new artists it has in store for me. Nothing is ever perfect when it comes to Spotify, and even AI DJs request feature has its setbacks, but nothing major. One of the first things I noticed was that this new function isnt compatible with my smart speaker (I use anEcho Pop), which I rely on constantly for my listening sessions. However, I cant speak for other smart speaker models. Its also not ideal if youre a serial song skipper, as a request segment ends after 20 songs, which I tested three times, so I wouldnt recommend using it if this is a habit of yours. When I look back on my return to AI DJ, I had quite a pleasant experience and felt that I had more control over what I wanted to hear, and even after I experimented with voice requests, I found myself revisiting AI DJ in its original form. While Daylist is still my supreme AI tool in Spotify, AI DJ has become a new favorite."
}